In [ ]:
"""
id is the primary key, user id
number is the score of the user
find from table grade the score with 3 or more coccurance
"""

In [ ]:
"""SQL table creation and data insertion"""
drop table if exists grade;
CREATE TABLE `grade` (
`id` int(4) NOT NULL,
`number` int(4) NOT NULL,
PRIMARY KEY (`id`));

INSERT INTO grade VALUES
(1,111),
(2,333),
(3,111),
(4,111),
(5,333);

In [ ]:
"""SQL solution"""
SELECT number
FROM grade
GROUP BY number
HAVING COUNT(*) >= 3

In [1]:
"""pandas dataframe creation"""
import pandas as pd

grade = pd.DataFrame([[1, 111],
                      [2, 333],
                      [3, 111],
                      [4, 111],
                      [5, 333]],
                    columns=['id', 'number'])
grade.head()

   id  number
0   1     111
1   2     333
2   3     111
3   4     111
4   5     333

In [8]:
# 1 use size() after groupby
df = grade.groupby('number').size().reset_index(name='cnt')
df

   number  cnt
0     111    3
1     333    2

In [10]:
df[df['cnt']>=3]

   number  cnt
0     111    3

In [24]:
# 2 use aggregation function after groupby
df = grade.groupby('number').agg('count')
df = df.reset_index().rename(columns={'id': 'cnt'})
df

   number  cnt
0     111    3
1     333    2